swara_sandhi_rules = {
    'অ+অ': 'া',  # rule 1
    'অ+আ': 'া',
    'া+অ': 'া',
    'া+আ': 'া',

    'ি+ই': 'ী',  # rule 2
    'ি+ঈ': 'ী',
    'ী+ই': 'ী',
    'ী+ঈ': 'ী',

    'ু+উ': 'ূ',  # rule 3
    'ু+ঊ': 'ূ',
    'ূ+উ': 'ূ',
    'ূ+ঊ': 'ূ',

    'অ+ই': 'ে',  # rule 4
    'অ+ঈ': 'ে',
    'া+ই': 'ে',
    'া+ঈ': 'ে',

    'অ+উ': 'ো',  # rule 5
    'অ+ঊ': 'ো',
    'া+উ': 'ো',
    'া+ঊ': 'ো',

    'অ+ঋ': 'র্',  # rule 6
    'া+ঋ': 'র্',

    'অ+এ': 'ৈ',  # rule 7
    'অ+ঐ': 'ৈ',
    'া+এ': 'ৈ',
    'া+ঐ': 'ৈ',

    'অ+ও': 'ৌ',  # rule 8
    'অ+ঔ': 'ৌ',
    'া+ও': 'ৌ',
    'া+ঔ': 'ৌ',

    'ি+অ': '্য',  # rule 9
    'ি+আ': '্যা',
    'ি+উ': '্যু',
    'ি+ঊ': '্যূ',
    'ি+এ': '্যে',
    'ি+ঐ': '্যৈ',
    'ী+অ': '্য',
    'ী+আ': '্যা',

    'ু+অ': '্ব',  # rule 10
    'ু+আ': '্বা',
    'ু+ই': '্বি',
    'ু+ঈ': '্বী',
    'ু+এ': '্বে',
    'ূ+আ': '্বা',
    'ূ+ই': '্বি',

    'ঋ+অ': '্র',  # rule 11
    'ঋ+আ': '্রা',
    'ঋ+ই': '্রি',
    'ঋ+উ': '্রু',

    'ে+অ': 'য়',  # rule 12 and 13
    'ে+আ': 'য়া',
    'ৈ+অ': 'ায়',
    'ৈ+ই': 'ায়ি',

    'ো+অ': 'ব',  # rule 14 and 15
    'ো+আ': 'বা',
    'ো+ই': 'বি',
    'ো+এ': 'বে',
    'ৌ+অ': 'আব',
    'ৌ+ই': 'আবি',
    'ৌ+উ': 'আবু',
}

swara_sandhi_patterns = {
    'া': ['অ+অ', 'অ+আ', 'া+অ', 'া+আ'],
    'ী': ['ি+ই', 'ি+ঈ', 'ী+ই', 'ী+ঈ'],
    'ূ': ['ু+উ', 'ু+ঊ', 'ূ+উ', 'ূ+ঊ'],
    'ে': ['অ+ই', 'অ+ঈ', 'া+ই', 'া+ঈ'],
    'ো': ['অ+উ', 'অ+ঊ', 'া+উ', 'া+ঊ'],
    'র্': ['অ+ঋ', 'া+ঋ'],
    'ৈ': ['অ+এ', 'অ+ঐ', 'া+এ', 'া+ঐ'],
    'ৌ': ['অ+ও', 'অ+ঔ', 'া+ও', 'া+ঔ'],
    '্য': ['ি+অ', 'ী+অ'],
    '্যা': ['ি+আ', 'ী+আ'],
    '্যু': ['ি+উ'],
    '্যূ': ['ি+ঊ'],
    '্যে': ['ি+এ'],
    '্যৈ': ['ি+ঐ'],
    '্ব': ['ু+অ'],
    '্বা': ['ু+আ', 'ূ+আ'],
    '্বি': ['ু+ই', 'ূ+ই'],
    '্বী': ['ু+ঈ'],
    '্বে': ['ু+এ'],
    '্র': ['ঋ+অ'],
    '্রা': ['ঋ+আ'],
    '্রি': ['ঋ+ই'],
    '্রু': ['ঋ+উ'],
    'য়': ['ে+অ'],
    'য়া': ['ে+আ'],
    'ায়': ['ৈ+অ'],
    'ায়ি': ['ৈ+ই'],
    'ব': ['ো+অ'],
    'বা': ['ো+আ'],
    'বি': ['ো+ই'],
    'বে': ['ো+এ'],
    'আব': ['ৌ+অ'],
    'আবি': ['ৌ+ই'],
    'আবু': ['ৌ+উ']
}

byanjan_sandhi_rules = {
    # rule A1

    # rule A2

    # rule 1

    'ৎ+চ': 'চ্চ',  # rule 2
    'দ+চ': 'চ্চ',
    'ৎ+ছ': 'চ্ছ',
    'দ+ছ': 'চ্ছ',

    'ৎ+জ': 'জ্জ',  # rule 3
    'দ+জ': 'জ্জ',
    'ৎ+ঝ': 'জ্ঝ',
    'দ+ঝ': 'জ্ঝ',

    'ৎ+ন': 'ন্ন',  # rule 4
    'দ+ন': 'ন্ন',
    'ৎ+ম': 'ন্ম',
    'দ+ম': 'ন্ম',

    'ৎ+ল': 'ল্ল',  # rule 5
    'দ+ল': 'ল্ল',

    'ৎ+শ': 'চ্ছ',  # rule 6
    'দ+শ': 'চ্ছ',
    'ৎ+হ': 'দ্ধ',
    'দ+হ': 'দ্ধ',

    'ক+ন': 'ঙ্ন',  # rule 7
    'ক+ম': 'ঙ্‌ম',

    'ট+ন': 'ণ্ন',  # rule 8
    'ট+ম': 'ণ্ম',

    # 'ম+ক':'ংক',    # rule 9
    'ম+গ': 'ংগ',
    'ম+য': 'ংয',
    'ম+র': 'ংর',
    'ম+ল': 'ংল',
    'ম+ব': 'ংব',
    'ম+শ': 'ংশ',
    'ম+স': 'ংস',
    'ম+ষ': 'ংষ',
    'ম+হ': 'ংহ',

    'ম+ত': 'ন্ত',  # rule 10
    'ম+থ': 'ন্থ',
    'ম+দ': 'ন্দ',
    'ম+ধ': 'ন্ধ',
    'ম+ন': 'ন্ন',

    'ম+চ': 'ঞ্চ',  # rule 11
    'ম+ছ': 'ঞ্ছ',
    'ম+জ': 'ঞ্জ',
    'ম+ঝ': 'ঞ্ঝ',
    # 'ম+ঞ':'ঞ',

    'ষ+ত': 'ষ্ট',  # rule 12
    'ষ+থ': 'ষ্ঠ',

    'চ+ন': 'চ্ঞ',  # rule 13
    'জ+ন': 'জ্ঞ',

    # rule 14

    'ম+ক': 'ংস্ক',  # rule 15
    'ি+ক': 'ংষ্ক',

    # rule 16

}

byanjan_sandhi_patterns = {
    'চ্চ': ['ৎ+চ', 'দ+চ'],
    'চ্ছ': ['ৎ+ছ', 'দ+ছ', 'ৎ+শ', 'দ+শ'],
    'জ্জ': ['ৎ+জ', 'দ+জ'],
    'জ্ঝ': ['ৎ+ঝ', 'দ+ঝ'],
    'ন্ন': ['ৎ+ন', 'দ+ন', 'ম+ন'],
    'ন্ম': ['ৎ+ম', 'দ+ম'],
    'ল্ল': ['ৎ+ল', 'দ+ল'],
    'দ্ধ': ['ৎ+হ', 'দ+হ'],
    'ঙ্ন': ['ক+ন'],
    'ঙ্‌ম': ['ক+ম'],
    'ণ্ন': ['ট+ন'],
    'ণ্ম': ['ট+ম'],
    'ংগ': ['ম+গ'],
    'ংয': ['ম+য'],
    'ংর': ['ম+র'],
    'ংল': ['ম+ল'],
    'ংব': ['ম+ব'],
    'ংশ': ['ম+শ'],
    'ংস': ['ম+স'],
    'ংষ': ['ম+ষ'],
    'ংহ': ['ম+হ'],
    'ন্ত': ['ম+ত'],
    'ন্থ': ['ম+থ'],
    'ন্দ': ['ম+দ'],
    'ন্ধ': ['ম+ধ'],
    'ঞ্চ': ['ম+চ'],
    'ঞ্ছ': ['ম+ছ'],
    'ঞ্জ': ['ম+জ'],
    'ঞ্ঝ': ['ম+ঝ'],
    'ষ্ট': ['ষ+ত'],
    'ষ্ঠ': ['ষ+থ'],
    'চ্ঞ': ['চ+ন'],
    'জ্ঞ': ['জ+ন'],
    'ংস্ক': ['ম+ক'],
    'ংষ্ক': ['ি+ক'],

}

bisarga_sandhi_rules = {

}

bisarga_sandhi_patterns = {

}

all_sandhi_patterns = {}
all_sandhi_patterns.update(swara_sandhi_patterns)
all_sandhi_patterns.update(byanjan_sandhi_patterns)
all_sandhi_patterns.update(bisarga_sandhi_patterns)
