swara_sandhi_ex_1 = [
    'মিষ্ট + অন্ন',  # rule 1
    'পদ + অর্পণ',
    'স্ব + অধীনতা',
    'ওষ্ঠ + অধর',
    'কুল + অঙ্গার',
    'রক্ত + অক্ত',
    'স্থান + অন্তর',
    'মিষ্ট + অন্ন',
    'পদ + অর্পণ',
    'স্ব + অধীনতা',
    'সিংহ + আসন',
    'চির + আচরিত',
    'যম + আলয়',
    'মেঘ + আচ্ছন্ন',
    'চিত্ত + আকর্ষক',
    'স্নেহ + আশিস',
    'জল + আশয়',
    'স্নেহ + আর্দ্র',
    'রত্ন + আকর',
    'গ্রন্থ + আগার',
    'পার + আবার',
    'সম + আগম',
    'মহা + অর্ঘ',
    'বিদ্যা + অভ্যাস',
    'চিন্তা + অদ্বিত',
    'আশা + অতিরিক্ত',
    'শিক্ষা + অনুরাগ',
    'শ্রদ্ধা + অঞ্জলি',
    'ভাষা + অন্তর',
    'আশা + অতীত',
    'মহা + অর্ণব',
    'তথা + অপি',
    'রাজা + অনুজ',
    'পূজা + অর্চনা',
    'শিক্ষা + আয়তন',
    'বিদ্যা + আলয়',
    'সুধা + আকর',
    'মহা + আশয়',
    'কারা + আগার',
    'আশা + আহত',
    'তন্দ্রা + আচ্ছন্ন',
    'ক্ষুধা + আতুর',
    'মাত্রা + আধিক্য',
    'সিংহ + আসন',
    'চির + আচরিত',
    'যম + আলয়',
    'মেঘ + আচ্ছন্ন',
    'চিত্ত + আকর্ষক',
    'স্নেহ + আশিস',
    'জল + আশয়',
    'স্নেহ + আর্দ্র',
    'রত্ন + আকর',
    'গ্রন্থ + আগার',
    'পার + আবার',
    'সম + আগম',
    'মহা + অর্ঘ',
    'বিদ্যা + অভ্যাস',
    'চিন্তা + অদ্বিত',
    'শিক্ষা + অনুরাগ',
    'শ্রদ্ধা + অঞ্জলি',
    'ভাষা + অন্তর',
    'আশা + অতীত',
    'মহা + অর্ণব',
    'তথা + অপি',
    'রাজা + অনুজ',
    'শিক্ষা + আয়তন'

    'অতি + ইন্দ্রিয়',  # rule 2
    'অতি + ইত',
    'পিরি + ইন্দ্র',
    'যতি + ইন্দ্ৰ',
    'মণি + ইন্দ্ৰ',
    'অভি + ইষ্ট',
    'অধি + ইন',
    'রবি + ইন্দ্র',
    'কবি + ইন্দ্র',
    'অতি + ইব',
    'প্রতি + ইতি',
    'ক্ষিতি + ইন্দ্ৰ',
    'অতি + ইন্দ্রিয়',
    'অতি + ইত',
    'পিরি + ইন্দ্র',
    'যতি + ইন্দ্ৰ',
    'মণি + ইন্দ্ৰ',
    'অভি + ইষ্ট',
    'অধি + ইন',
    'রবি + ইন্দ্র',
    'কবি + ইন্দ্র',
    'অতি + ইব',
    'প্রতি + ইতি',
    'ক্ষিতি + ইন্দ্ৰ',

    'কটু + উক্তি',  # rule 3
    'মরু + উদ্যান',
    'বিধু + উদয়',
    'সাধু + উত্তম',
    'অনু + উদিত',
    'মধু + উৎসব',
    'সাধু + উর্ধ্ব ',
    'মৃত্যু + উত্তীর্ণ ',
    'সু+ উত্ত',
    'লঘু + উর্মি ',
    'বহু + উর্ধ্ব ',
    'তনু + উর্ধ্ব',
    'সিম্ধু + উর্মি',
    'কানু + উহ',
    'বধু + উক্তি',
    'সরযু + উপাদান',
    'চমু + উপনীত',
    'বধু + উদয়',
    'বধু + উৎসব',
    'সরযু + উর্মি',
    'শশ্ + উহ',
    'তনু + উন',
    'বধু + উক্তি',

    'বল + ইন্দ্র',  # rule 4
    'স্ব+ ইচ্ছা',
    'দিব্য + ইন্দু',
    'দেব + ইন্দ্র',
    'পূর্ণ + ইন্দু',
    'অন্ত্য + ইষ্টি',
    'শুভ + ইচ্ছা',
    'বীর + ইন্দ্র',
    'পঞ্চ+ ইন্দ্রিয়',
    'রাক্ষস + ইন্দ্রাণী',
    'শ্রবণ + ইন্দ্রিয়',
    'প্রণব + ইন্দু ',
    'অপ + ঈক্ষা',
    'সিদ্ধ + ঈশ্বরী'
    'ভব + ঈশ',
    'অব + ঈক্ষণ',
    'ভব + ঈশ্বরী',
    'হুষীক + ঈশ',
    'রাজ্য + ঈশ্বর',
    'গণ + ঈশ',
    'বীর + ঈশ',
    'পরম + ঈশ্বর',
    'প্রাণ + ঈশ',
    'ব্ৰজ + ঈশ',
    'রসনা + ইন্দ্রিয়',
    'মহা + ইন্দ্র',
    'যথা + ইষ্ট',
    'যথা + ইচ্ছা',
    'রমা + ইন্দ্ৰ',
    'দ্বারকা + ইন্দু',
    'মহা + ঈশ্বর',

    'উত্তর + উত্তর',  # rule 5
    'পর + উপকার',
    'অস্ত্র + উপচার',
    'আদ্য + উপান্ত',
    'অতিশয় + উক্তি',
    'অর্ধ + উচ্চারিত',
    'সর্ব + উচ্চ',
    'পুষ্প + উদ্যান',
    'সর্ব + উত্তম',
    'শীত + উয়',
    'জল + উচ্ছ্বাস',
    'রস + উত্তীর্ণ',
    'নীল + উৎপন্ন',
    'দাম + উদর',
    'সুপ্ত + উ্থিত',
    'কুল + উদ্ভব',
    'প্রথম + উত্ত',
    'গাত্র + উত্থান',
    'চল + উর্মি',
    'কথা + উপকথন',
    'স্বাধীনতা + উত্তর',
    'নব + উঢ়া',
    'দুর্গা + উৎসব',
    'যথা + উপযুক্ত',
    'গীতা + উক্ত',
    'যথা + উচিত',
    'বিদ্যা + উদয়',
    'মহা + উর্মি',
    'পর্বত + উর্ধ্ব',
    'গঙ্গা + উদক',
    'পূজা + উপাসনা',
    'মহা + উচ্চতা',
    'মহা + উপকার',
    'বিদ্যা + উপার্জন',
    'গঙ্গা + উদক',
    'পূজা + উপাসনা',
    'মহা + উচ্চতা',
    'মহা + উপকার',
    'বিদ্যা + উপার্জন',

    'উত্তম + ঋণ',  # rule 6
    'সপ্ত + ঋষি',
    'দেব + ঋষি',
    'অধম + ঋণ',
    'রাজা + ঋষি',
    'মহা + ঋষভ',
    'মহা + ঋষি',
    'উত্তম + ঋণ',
    'সপ্ত + ঋষি',
    'অধম + ঋণ',

    'জন + এক',  # rule 7
    'হিত + এষণা',
    'শুভ + এষী',
    'অন + ঐক্য',
    'ধন + ঐশ্বর্য',
    'কর্ম + এষা',
    'হিত + এষী',
    'সর্ব+ এব',
    'বিত্ত + ঐশ্বর্য',
    'চিত্ত + ঐশ্বর্য',
    'মত + ঐক্য',
    'রাজ + ঐশ্বর্য',
    'তথা + এবচ',
    'সদা + এব',
    'বসুধা + এব',
    'মহা + ঐশ্বর্য ',
    'মহা + ঐরাবত',
    'হিত + এষণা',
    'বিত্ত + ঐশ্বর্য',
    'মত + ঐক্য',
    'মহা + ঐশ্বর্য',
    'মহা + ঐরাবত',

    'বন + ওষধি',  # rule 8
    'পরম + ঔষধ',
    'চিত্ত + ঔদার্য',
    'মহা + ওষধি',
    'মহা + ঔদার্য ',
    'মহা + ঔৎসুক্য',
    'বন + ওষধি',
    'পরম + ঔষধ',
    'চিত্ত + ঔদার্য',
    'মহা + ওষধি',
    'মহা + ঔদার্য ',
    'মহা + ঔৎসুক্য',
]

swara_sandhi_ex_2 = [
    'আদি + অন্ত',  # rule 9
    'অধি + অয়ন',
    'প্রতি + অক্ষ',
    'বি + অর্থ',
    'গতি + অন্তর',
    'প্রতি + অহ ',
    'গতি + অন্তর',
    'ইতি + আদি',
    'অতি + আচার',
    'প্রতি + আবর্তন',
    'অভি + আগত ',
    'অধি + আরূঢ',
    'ইতি + আদি',
    'অতি + আচার ',
    'প্রতি + আবর্তন',
    'অভি + আগত ',
    'অধি + আরূঢ',
    'ইতি + অবসরে',
    'যদি + অপি',
    'বি + অতীত',
    'বি + অবহার ',
    'অতি + অন্ত',
    'পরি + অটন',
    'ইতি + অবসরে',
    'যদি + অপি',
    'বি + অতীত',
    'বি + অবহার ',
    'অতি + অন্ত',
    'পরি + অটন',
    'প্রতি + আশিত',
    'অতি + আশ্চর্য',
    'বি + আকুলতা',
    'প্রতি + আখ্যান',
    'অগ্নি + আশয়',
    'প্রতি + আশিত',
    'অতি + আশ্চর্য',
    'বি + আকুলতা',
    'প্রতি + আখ্যান',
    'অগ্নি + আশয়',
    'প্রতি + আগমন',
    'প্রতি + আশা',
    'অতি + আবশ্যিক'
    'প্রতি + আদেশ',
    'অগ্নি + আধান',
    'প্রতি + আগমন',
    'প্রতি + আশা',
    'অতি + আবশ্যিক',
    'প্রতি + আদেশ',
    'অগ্নি + আধান',

    'সু+ অল্প',  # rule 10
    'সু + অস্তি',
    'সু+ অর্ণ',
    'সু+ অচ্ছ',
    'পশু + অধম',
    'অনু + অয়',
    'ধাতু + অবয়ব',
    'মনু + অন্তর',
    'সু + আগত',
    'পশু + আচার',
    'বধু + আগমন',
    'অনু + ইত',
    'তনু + ঈ',
    'গুরু + ঈ'
    'অনু + এষণ',
    'সু + আগত',
    'পশু + আচার',
    'বধু + আগমন',
    'অনু + ইত',
    'তনু + ঈ',
    'অনু + এষণ'

    'পিতৃ + অনুমতি',  # rule 11
    ' পিতৃ + অর্থ',
    'মাতৃ + আদেশ',
    'মাতৃ + আলয়',
    'পিতৃ + ইচ্ছা',
    'মাতৃ + ইচ্ছা',
    'পিতৃ + উপদেশ',
    'মাতৃ + উপদেশ',
    'পিতৃ + অনুমতি',
    'পিতৃ + অর্থ',
    'মাতৃ + আদেশ',
    'মাতৃ + আলয়',
    'পিতৃ + ইচ্ছা',
    'পিতৃ + উপদেশ',

    'এ + অ',  # rule 12
    'নে + অন',
    'চে + অন',
    'এ + আ ',
    'শে + আন্'
    'বে+ আন',
    'নে + অন',

    'ঐ + অ',  # rule 13
    'গৈ + অক',
    'নৈ + অক',
    'ঐ + ই',
    'নৈ + ইকা',
    'দৈ + ইকা',
    'গৈ + অক',
    'ঐ + ই ',
    'দৈ + ইকা',

    'ও + অ',  # rule 14
    'পাে+ অন',
    'ও + ই',
    'পাে + ইত্র',
    'ও + আ',
    'গাে + আদি',
    'ও + এ',
    'গাে + এষণা',
    'পাে+ অন',

    'ঔ + অ',  # rule 15
    'ঔ + ই',
    'নৌ+ ইক',
    'ভৌ+ উক',
    'স্তৌ+ অক',
    'পৌ+ অক',
]

byanjan_sandhi_ex_1 = [
    'বাকৃ+ঈরী',
    'শরৎ+ইন্দু',  # Rule 1
    'তর +আশয়',
    'পৃথক্‌ + অন্ন',
    'প্রাক +উত্ত',
    'সৎ+উত্তর',
    'সুগ্‌+অন্ত',

    'বি+ছিন্ন',  # Rule 2
    'অনু+ ছেদ',
    'পূর্ণ + ছেদ',
    'আ+ ছনন',

    'বাক + জাল',
    'বিদ্যুৎ+ বেগে',  # Rule 3
    'উৎ+ ভিদ',
    'ভগবৎ + গীতা',

    'সৎ+ চরিত্র',  # Rule 4
    'উৎ+ চকিত',
    'উৎ+ ছেদ',
    'বিপদ + ছায়া',
    'উদ্‌ + নতি',
    'তদ্‌ + ময়',

    'উদ্ + লাস ',  # Rule5
    'বিদ্যুৎ + লেখন',
    'তদ্ + লিখিত ',
    'তদ্ + লোক',

    'চলৎ + শক্তি',  # Rule6
    'তদ্ + হিত',
    'উৎ + শ্বাস',
    'পদ্ + হতি',

    'বাক্ + ময়',  # Rule7
    'দিক্ + মণ্ডল',
    'দিক্ + নাগ',

    'ষট্ + মাস',  # Rule8

    'শম্ + কর',  # Rule9
    'সম্ + হতি',
    'সম্ + গত',
    'সম্ + যোগ',
    'সম্ + বাদ',

    'সম্ + ন্যাসী',  # Rule10
    'সম্ + দেশ',
    'সম্ + ধান',
    'কিম্ + নর',

    'সম্ + চয়',  # Rule11
    'সম্ + জয়',

    'বৃষ্ + তি',  # Rule12
    'ষষ্ + থ',
    'বিষ্ + থা',

    'যজ্ + ন',  # Rule13
    'যাচ্ + না',

    'তদ্ + কাল',  # Rule14
    'তদ্ + ত্ব',
    'তদ্ + সম',
    'তদ্ + পরতা',

    'সম্ + কার',  # Rule15
    'পরি + কার',
    'সম্ + কৃত',

    'উৎ + স্থান',  # Rule16
    'উৎ + স্থাপিত'

]

byanjan_sandhi_ex_2 = [

]

bisarga_sandhi_ex = [
    'দুঃ + চরিত্র',  # Rule1
    'নিঃ + চিহ্ন',
    'নিঃ + ছিদ্র'

    'ধনুঃ + টঙ্কর',  # Rule2
    'চতুঃ + টয়',

    'নিঃ + তার',  # Rule3
    'ইতঃ + তত',
    'মনঃ + তাপ',

    'পুরঃ + কার',  # Rule4
    'তিরঃ + কার'

    'নিঃ + প্রভ',  # Rule5
    'নিঃ + কলঙ্ক',
    'ভ্রাতুঃ + পুত্র',
    'আবিঃ + কার',

    'স্বঃ + গত',  # Rule6
    'প্রাতঃ + আশ',
    'অন্তঃ + ধান',
    'অন্তঃ + হিত',

    'মনঃ + মোহন',  # Rule7
    'মনঃ + যোগ',
    'মনঃ + হর',
    'মনঃ + ভাব',
    'যশঃ + লাভ',

    'নিঃ + রব',  # Rule8
    'নিঃ + রোগ',
    'নিঃ + রস',
    'নিঃ + রক্ত'
]

misc_ex = [
    'বিদ্যা + আলয় ',
    'নদী + অম্বু',
    'মসী + আধার ',
    'পরি + অবেক্ষণ',

]

swara_sandhi_ex = swara_sandhi_ex_1 + swara_sandhi_ex_2
byanjan_sandhi_ex = byanjan_sandhi_ex_1 + byanjan_sandhi_ex_2
