test_cases_add_1 = [
    'বিদ্যা + আলয়',
    'শুভ + ইচ্ছা',
    'দেব + ঋষি',
    'রাজা + ঋষি',
    'বিদ্যা +	অর্ণব',
    'রবি + ইন্দ্র',
    'মহা + ঈশ',
    'আদি	+অন্ত',
    'ইতি	+আদি	',
    'নদী	+অম্বু',
    'মসী	+আধার',
    # 'পশু	+অধ্ম',
    'সু	+ আগত',
    'পরি	+অবেক্ষণ',
    'সাধু+ঈ',
]

test_cases_split_1 = [
    'বিদ্যালয়  ',
    'শুভেচ্ছা ',
    'দেবর্ষি ',
    'রাজর্ষি',
    'বিদ্যার্ণব ',
    'রবীন্দ্র ',
    ' মহেশ ',
    'আদ্যন্ত ',
    ' ইত্যাদি ',
    'নদ্যম্বু ',
    'মস্যাধার ',
    # 'পশ্বধ্ম ',
    'স্বাগত ',
    'পর্যবেক্ষণ ',
    'সাধ্বী ',

]

test_cases_add_2 = [
    # 'সৎ+চরিত্র', 'উৎ+চকিত', 'উৎ+ছেদ', 'বিপদ+ছায়া',
    'উদ্+নতি', 'তদ্+ময়', 'উদ্+লাস',
    # 'বিদ্যুৎ+লেখন',
    'তদ্+লিখিত', 'তদ্+লোক',
    # 'চলৎ+শক্তি',
    'তদ্+হিত',
    # 'উৎ+শ্বাস',
    'পদ্+হতি',
    'বাক্+ময়', 'দিক্+মণ্ডল', 'দিক্+নাগ', 'ষট্+মাস', 'শম্+কর', 'সম্+হতি', 'সম্+গত', 'সম্+যোগ',
    'সম্+বাদ', 'সম্+ন্যাসী', 'সম্+দেশ', 'সম্+ধান', 'কিম্+নর', 'সম্+চয়', 'সম্+জয়', 'বৃষ্+তি',
    'ষষ্+থ', 'বিষ্+থা', 'যজ্+ন', 'যাচ্+না',
    # 'তদ্+কাল', 'তদ্+ত্ব', 'তদ্+সম', 'তদ্+পরতা',
    'সম্+কার',
    'পরি+কার', 'সম্+কৃত',
    # 'উৎ+স্থান', 'উৎ+স্থাপিত',
]

test_cases_split_2 = [
    'পদ্ধতি',
    'বাঙ্‌ময়',
    ' দিঙ্‌মণ্ডল ',
    ' দিঙ্নাগ',
    ' ষণ্মাস ',
    'শংস্কর',
    ' সংহতি ',
    ' সংগত ',
    'সংযোগ ',
    ' সংবাদ ',
    ' সন্দেশ',
    '  সন্ধান  ',
    ' ষষ্ঠ',
    '  কিন্নর  ',
    'সঞ্চয়',
    ' সঞ্জয় ',
    ' বৃষ্টি ',
    'বিষ্ঠা ',
    ' যজ্ঞ ',
    'যাচ্ঞা',

]

test_cases_add = test_cases_add_1 + test_cases_add_2
test_cases_split = test_cases_split_1 + test_cases_split_2
